# https://givitallugot.github.io/articles/2020-03/R-visualization-1-seoulmap
# 참조

#=========================================================
# map을 그리기 위해 필요한 라이브러리
#=========================================================
library(ggmap)
library(ggplot2)
library(raster)
library(rgeos)
library(maptools)
library(rgdal)

#=========================================================
# 지도 시각화
# 시각화 대상이 되는 내 데이터 셋 + 지도 그림 데이터 셋 = merge_data -> ggplot에 대입
# 내 데이터셋
#=========================================================
df = read.csv(file = "df.csv")

#=========================================================
# 불필요한 변수 제거
#=========================================================
df <- subset(df, select = -c(X))

#=========================================================
# 서울 지역구 아이디 df
#=========================================================
seoul_id = read.csv(file = "seoul_id.csv")

#=========================================================
# 시군구명을 중심으로 아이디 추가
#=========================================================
names(seoul_id) <- c("district", "id")

df <- merge(seoul_id, df)
df

#=========================================================
# 지리 정보 데이터셋
#=========================================================
map <- shapefile("LARD_ADM_SECT_SGG_서울/LARD_ADM_SECT_SGG_11.shp") # 경고 메세지 뜨지만 지도는 제대로 뜸
library(dplyr)
map@polygons[[1]]@Polygons[[1]]@coords %>% head(n = 10L)
plot(map)

#=========================================================
# map을 spTransform()함수 이용하여 좌표계 변환 진행
#=========================================================
map <- spTransform(map, CRSobj = CRS("+proj=longlat +ellps=WGS84 +no_defs"))
# map을 data frame으로 변환 fortify()함수 사용
map <- fortify(map, region="ADM_SECT_C")
View(map)

#=========================================================
# id num으로 변경
#=========================================================
map$id <- as.numeric(map$id)

#=========================================================
# id가 11740이하가 서울시 구에 해당 (서울시 데이터만 추출)
#=========================================================
map <- map[map$id <= 11740,]

#=========================================================
# 시각화 할 자료와 map 을 id로 합치기
#=========================================================
df <- merge(map, df, by = "id")

#=========================================================
### 지도 그리기
#=========================================================
ggplot() + geom_polygon(data = df, aes(x=long, y=lat, group=group), fill = "#ffffff", color="black")


# fill 값에 기준이 되는 데이터를 넣어서 지도에 색을 넣을 수 있음
ggplot() + geom_polygon(data = df, aes(x=long, y=lat, group=group, fill = Crime, color = "black"))


